       >>SOURCE FORMAT FREE
identification division.
program-id. HELLOWORLD.

environment division.

data division.
working-storage section.
01 blarg PIC X(12) value 'BELLO WORLD'.

procedure division.
display blarg.
stop run.
